{
    "monsterName": "Broom of Animated Attack",
    "monsterType": "Small construct, unaligned",
    "monsterArmor": "Armor Class 15 (natural armor)",
    "monsterHP": "Hit Points 17 (5d6)",
    "monsterSpeed": "Speed 0 ft., fly 50 ft. (hover)",
    "monsterSTR": "10 (0)",
    "monsterDEX": "17 (+3)",
    "monsterCON": "10 (0)",
    "monsterINT": "1 (-5)",
    "monsterWIS": "5 (-3)",
    "monsterCHA": "1 (-5)",
    "monsterSavings": "",
    "monsterSkills": "",
    "monsterVulnerabilities": "",
    "mosnterResistances": "",
    "monsterImmunities": "Damage Immunities poison, psychic",
    "monsterCImmunities": "Condition Immunities blinded, charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned, prone",
    "monsterSenses": "Senses blindsight 30 ft. (blind beyond this radius)",
    "monsterLanguages": "",
    "monsterChallenge": "Challenge  1/4 (50 XP)",
    "monsterSpecials": [
        "Constructed Nature. An animated object doesn't require air, food, drink, or sleep.",
        "The magic that animates an object is dispelled when the construct drops to 0 hit points. An animated object reduced to 0 hit points becomes inanimate and is too damaged to be of much use or value to anyone.",
        "Antimagic Susceptibility. The broom is incapacitated while in the area of an antimagic field. If targeted by dispel magic, the broom must succeed on a Constitution saving throw against the caster's spell save DC or fall unconscious for 1 minute.",
        "False Appearance. While the broom remains motionless and isn't flying, it is indistinguishable from a normal broom."
    ],
    "monsterActions": [
        "_____________________ Actions _____________________",
        "Multiattack. The broom makes two melee attacks.",
        "Broomstick. Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 5 (1d4+3) bludgeoning damage.",
        "Reactions",
        "Animated Attack. If the broom is motionless and a creature grabs hold of it, the broom makes a Dexterity check contested by the creature's Strength check. If the broom wins the contest, it flies out of the creature's grasp and makes a melee attack against it with advantage on the attack roll."
    ]
}