{
    "monsterName": "Drow Mage",
    "monsterType": "Medium humanoid (elf), neutral evil",
    "monsterArmor": "Armor Class 12 (15 with mage armor)",
    "monsterHP": "Hit Points 45 (10d8)",
    "monsterSpeed": "Speed 30 ft.",
    "monsterSTR": "9 (-1)",
    "monsterDEX": "14 (+2)",
    "monsterCON": "10 (0)",
    "monsterINT": "17 (+3)",
    "monsterWIS": "13 (+1)",
    "monsterCHA": "12 (+1)",
    "monsterSavings": "",
    "monsterSkills": "Skills Arcana +6, Deception +5, Perception +4, Stealth +5",
    "monsterVulnerabilities": "",
    "monsterResistances": "",
    "monsterImmunities": "",
    "monsterCImmunities": "",
    "monsterSenses": "Senses darkvision 120 ft.",
    "monsterLanguages": "Languages Elvish, Undercommon",
    "monsterChallenge": "Challenge  7 (2,900 XP)",
    "monsterSpecials": [
        "Fey Ancestry. The drow has advantage on saving throws against being charmed, and magic can't put the drow to sleep.",
        "Innate Spellcasting. The drow's spellcasting ability is Charisma (spell save DC 12). It can innately cast the following spells, requiring no material components: \n\nAt will: dancing lights\n\n1/day each: darkness, faerie fire, levitate (self only)\n\n",
        "Spellcasting. The drow is a 10th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 14, +6 to hit with spell attacks). The drow has the following wizard spells prepared: \n\nCantrips (at will): mage hand, minor illusion, poison spray, ray of frost\n\n1st level (4 slots): mage armor, magic missile, shield, witch bolt\n\n2nd level (3 slots): alter self, misty step, web\n\n3rd level (3 slots): fly, lightning bolt\n\n4th level (3 slots): Evard's black tentacles, greater invisibility\n\n5th level (2 slots): cloudkill\n\n",
        "Sunlight Sensitivity. While in sunlight, the drow has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
    ],
    "monsterActions": [
        "_____________________ Actions _____________________",
        "Staff. Melee Weapon Attack: +2 to hit, reach 5 ft., one target. Hit: 2 (1d6-1) bludgeoning damage, or 3 (1d8-1) bludgeoning damage if used with two hands, plus 3 (1d6) poison damage.",
        "Summon Demon (1/Day). The drow magically summons a quasit, or attempts to summon a shadow demon with a 50 percent chance of success. The summoned demon appears in an unoccupied space within 60 feet of its summoner, acts as an ally of its summoner, and can't summon other demons. It remains for 10 minutes, until it or its summoner dies, or until its summoner dismisses it as an action."
    ]
}