{
    "monsterName": "Illithilich",
    "monsterType": "Medium undead, any evil alignment",
    "monsterArmor": "Armor Class 17 (natural armor)",
    "monsterHP": "Hit Points 135 (18d8+54)",
    "monsterSpeed": "Speed 30 ft.",
    "monsterSTR": "11 (0)",
    "monsterDEX": "16 (+3)",
    "monsterCON": "16 (+3)",
    "monsterINT": "20 (+5)",
    "monsterWIS": "14 (+2)",
    "monsterCHA": "16 (+3)",
    "monsterSavings": "Saving Throws Con +10, Int +12, Wis +9",
    "monsterSkills": "Skills Arcana +18, History +12, Insight +9, Perception +9",
    "monsterVulnerabilities": "",
    "monsterResistances": "Damage Resistances cold, lightning, necrotic",
    "monsterImmunities": "Damage Immunities poison; bludgeoning, piercing, and slashing from nonmagical weapons",
    "monsterCImmunities": "Condition Immunities charmed, exhaustion, frightened, paralyzed, poisoned",
    "monsterSenses": "Senses truesight 120 ft.",
    "monsterLanguages": "Languages Deep Speech, Undercommon, telepathy 120 ft.",
    "monsterChallenge": "Challenge  22 (41,000 XP)",
    "monsterSpecials": [
        "Legendary Resistance (3/Day). If the illithilich fails a saving throw, it can choose to succeed instead.",
        "Rejuvenation. If it has a phylactery, a destroyed illithilich gains a new body in 1d10 days, regaining all its hit points and becoming active again. The new body appears within 5 feet of the phylactery.",
        "Spellcasting. The illithilich is an 18th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 20, +12 to hit with spell attacks). The lich has the following wizard spells prepared: \n\nCantrips (at will): mage hand, prestidigitation, ray of frost\n\n1st level (4 slots): detect magic, magic missile, shield, thunderwave\n\n2nd level (3 slots): detect thoughts, invisibility, Melf's acid arrow, mirror image\n\n3rd level (3 slots): animate dead, counterspell, dispel magic, fireball\n\n4th level (3 slots): blight, dimension door\n\n5th level (3 slots): cloudkill, scrying\n\n6th level (1 slot): disintegrate, globe of invulnerability\n\n7th level (1 slot): finger of death, plane shift\n\n8th level (1 slot): dominate monster, power word stun\n\n9th level (1 slot): power word kill\n\n",
        "Turn Resistance. The illithilich has advantage on saving throws against any effect that turns undead.",
        "Magic Resistance. The illithilich has advantage on saving throws against spells and other magical effects.",
        "Innate Spellcasting (Psionics). The illithilich's innate spellcasting ability is Intelligence (spell save DC 20). It can innately cast the following spells, requiring no components.\n\nAt will: detect thoughts, levitate\n\n1/day each: dominate monster, plane shift (self only)\n\n"
    ],
    "monsterActions": [
        "_____________________ Actions _____________________",
        "Paralyzing Touch. Melee Spell Attack: +12 to hit, reach 5 ft., one creature. Hit: 10 (3d6) cold damage. The target must succeed on a DC 18 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "Tentacles. Melee Weapon Attack: +12 to hit, reach 5 ft., one creature. Hit: 21 (3d10+5) psychic damage. If the target is Large or smaller, it is grappled (escape DC 15) and must succeed on a DC 20 Intelligence saving throw or be stunned until this grapple ends.",
        "Extract Brain. Melee Weapon Attack: +12 to hit, reach 5 ft., one incapacitated humanoid grappled by the lich. Hit: 55 (10d10) piercing damage. If this damage reduces the target to 0 hit points, the lich kills the target by extracting and devouring its brain.",
        "Mind Blast (Recharge 5-6). The illithilich magically emits psychic energy in a 60-foot cone. Each creature in that area must succeed on a DC 18 Intelligence saving throw or take 27 (5d8+5) psychic damage and be stunned for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "Legendary Actions\n\nThe illithilich can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time, and only at the end of another creature's turn. The illithilich regains spent legendary actions at the start of its turn.\n\n",
        "Tentacles. The illithilich makes one attack with its tentacles. ",
        "Extract Brain (Costs 2 Actions). The illithilich uses Extract Brain.",
        "Mind Blast (Costs 3 Actions). The illithilich recharges its Mind Blast and uses it.",
        "Cast Spell (Costs 1-3 Actions). The illithilich uses a spell slot to cast a 1st-, 2nd-, or 3rd-level spell that it has prepared. Doing so costs 1 legendary action per level of the spell."
    ]
}