{
    "monsterName": "Ultroloth",
    "monsterType": "Medium fiend (yugoloth), neutral evil",
    "monsterArmor": "Armor Class 19 (natural armor)",
    "monsterHP": "Hit Points 153 (18d8+72)",
    "monsterSpeed": "Speed 30 ft., fly 60 ft.",
    "monsterSTR": "16 (+3)",
    "monsterDEX": "16 (+3)",
    "monsterCON": "18 (+4)",
    "monsterINT": "18 (+4)",
    "monsterWIS": "15 (+2)",
    "monsterCHA": "19 (+4)",
    "monsterSavings": "",
    "monsterSkills": "Skills Intimidation +9, Perception +7, Stealth +8",
    "monsterVulnerabilities": "",
    "mosnterResistances": "Damage Resistances cold, fire, lightning, bludgeoning, piercing, and slashing from nonmagical weapons",
    "monsterImmunities": "Damage Immunities acid, poison",
    "monsterCImmunities": "Condition Immunities charmed, frightened, poisoned",
    "monsterSenses": "Senses truesight 120 ft.",
    "monsterLanguages": "Languages Abyssal, Infernal, telepathy 120 ft.",
    "monsterChallenge": "Challenge  13 (10,000 XP)",
    "monsterSpecials": [
        "Innate Spellcasting. The ultroloth's innate spellcasting ability is Charisma (spell save DC 17). The ultroloth can innately cast the following spells, requiring no material components: \n\nAt will: alter self, clairvoyance, darkness, detect magic, detect thoughts, dispel magic, invisibility (self only), suggestion\n\n3/day each: dimension door, fear, wall of fire\n\n1/day each: fire storm, mass suggestion\n\n",
        "Magic Resistance. The ultroloth has advantage on saving throws against spells and other magical effects.",
        "Magic Weapons. The ultroloth's weapon attacks are magical."
    ],
    "monsterActions": [
        "_____________________ Actions _____________________",
        "Multiattack. The ultroloth can use its Hypnotic Gaze and makes three melee attacks.",
        "Longsword. Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) slashing damage, or 8 (1d10 + 3) slashing damage if used with two hands.",
        "Hypnotic Gaze. The ultroloth's eyes sparkle with opalescent light as it targets one creature it can see within 30 feet of it. If the target can see the ultroloth, the target must succeed on a DC 17 Wisdom saving throw against this magic or be charmed until the end of the ultroloth's next turn. The charmed target is stunned. If the target's saving throw is successful, the target is immune to the ultroloth's gaze for the next 24 hours.",
        "Teleport. The ultroloth magically teleports, along with any equipment it is wearing or carrying, up to 60 feet to an unoccupied space it can see.",
        "Variant: Summon Yugoloth (1/Day). The yugoloth chooses what to summon and attempts a magical summoning."
    ]
}